Белгипрозем_2017/src/InformationRegisters/СвязанныеЗаписиКалендаря/СвязанныеЗаписиКалендаря.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвязанныеЗаписиКалендаря</name>
  <resources>
    <name>ЗаписьКалендаря</name>
    <type>
      <types>CatalogRef.ЗаписиРабочегоКалендаря</types>
    </type>
  </resources>
  <dimensions>
    <name>Предмет</name>
    <type>
      <types>CatalogRef.Мероприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/Catalogs/ЗаписиРабочегоКалендаря/ЗаписиРабочегоКалендаря.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЗаписиРабочегоКалендаря</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесьДень</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПовторения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПовторения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалПовторения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПовторов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеКраткое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПовторениеПоДнямМесяца</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПовторениеПоМесяцам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоОкончанияПовторения</name>
    <type>
      <types>EnumRef.ПравилаОкончанияПовторения</types>
    </type>
  </attributes>
  <attributes>
    <name>Предмет</name>
    <type>
      <types>CatalogRef.Контроль</types>
      <types>CatalogRef.Корреспонденты</types>
      <types>CatalogRef.Проекты</types>
      <types>DocumentRef.ВходящееПисьмо</types>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>DocumentRef.ИсходящееПисьмо</types>
      <types>CatalogRef.Файлы</types>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
      <types>CatalogRef.Мероприятия</types>
      <types>CatalogRef.КонтактныеЛица</types>
      <types>CatalogRef.ПроектныеЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияЗаписейРабочегоКалендаря</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗаписиКалендаря</name>
    <type>
      <types>EnumRef.ТипЗаписиКалендаря</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧастотаПовторения</name>
    <type>
      <types>EnumRef.ЧастотаПовторения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсключенияПовторения</name>
    <attributes>
      <name>ДатаИсключения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаписьИсключения</name>
      <type>
        <types>CatalogRef.ЗаписиРабочегоКалендаря</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПовторениеПоДням</name>
    <attributes>
      <name>ДеньНедели</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерВхождения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Белгипрозем_2017/src/InformationRegisters/СвязанныеЗаписиКалендаря/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Читает записи календаря связанные с предметом
Функция ПолучитьСвязанныеЗаписиКалендаря(Предмет) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	СвязанныеЗаписиКалендаря.ЗаписьКалендаря КАК Ссылка,
		|	СвязанныеЗаписиКалендаря.Пользователь КАК Пользователь,
		|	ЗаписиРабочегоКалендаря.Состояние
		|ИЗ
		|	РегистрСведений.СвязанныеЗаписиКалендаря КАК СвязанныеЗаписиКалендаря
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЗаписиРабочегоКалендаря КАК ЗаписиРабочегоКалендаря
		|		ПО СвязанныеЗаписиКалендаря.ЗаписьКалендаря = ЗаписиРабочегоКалендаря.Ссылка
		|ГДЕ
		|	СвязанныеЗаписиКалендаря.Предмет = &Предмет");
	Запрос.УстановитьПараметр("Предмет", Предмет);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Создает связанную запись календаря
Процедура СоздатьСвязаннуюЗаписьКалендаря(Предмет, Пользователь, ЗаписьКалендаря) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = РегистрыСведений.СвязанныеЗаписиКалендаря.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Предмет = Предмет;
	МенеджерЗаписи.Пользователь = Пользователь;
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.ЗаписьКалендаря <> ЗаписьКалендаря Тогда
		
		МенеджерЗаписи.Предмет = Предмет;
		МенеджерЗаписи.Пользователь = Пользователь;
		МенеджерЗаписи.ЗаписьКалендаря = ЗаписьКалендаря;
		МенеджерЗаписи.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает связанный предмет с записью календаря
Функция ПолучитьСвязанныйПредметИПользователя(ЗаписьКалендаря) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	СвязанныеЗаписиКалендаря.Предмет,
		|	СвязанныеЗаписиКалендаря.Пользователь
		|ИЗ
		|	РегистрСведений.СвязанныеЗаписиКалендаря КАК СвязанныеЗаписиКалендаря
		|ГДЕ
		|	СвязанныеЗаписиКалендаря.ЗаписьКалендаря = &ЗаписьКалендаря");
	Запрос.УстановитьПараметр("ЗаписьКалендаря", ЗаписьКалендаря);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	СтруктураРезультата = Новый Структура("Предмет, Пользователь");
	ЗаполнитьЗначенияСвойств(СтруктураРезультата, Выборка);
	
	Возврат СтруктураРезультата;
	
КонецФункции

// Возвращает массив исключений занятости
Функция ПолучитьИсключенияЗанятости(ИсключенияЗанятости) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивИсключенийЗанятости = Новый Массив;
	
	Если Не ЗначениеЗаполнено(ИсключенияЗанятости) Тогда
		Возврат МассивИсключенийЗанятости;
	КонецЕсли;
	
	Если ТипЗнч(ИсключенияЗанятости) = Тип("Массив") Тогда
		МассивПредметовИсключенийЗанятости = ИсключенияЗанятости;
	Иначе
		МассивПредметовИсключенийЗанятости = Новый Массив;
		МассивПредметовИсключенийЗанятости.Добавить(ИсключенияЗанятости);
	КонецЕсли;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	СвязанныеЗаписиКалендаря.ЗаписьКалендаря
		|ИЗ
		|	РегистрСведений.СвязанныеЗаписиКалендаря КАК СвязанныеЗаписиКалендаря
		|ГДЕ
		|	СвязанныеЗаписиКалендаря.Предмет В (&ИсключенияЗанятости)");
	Запрос.УстановитьПараметр("ИсключенияЗанятости", МассивПредметовИсключенийЗанятости);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат МассивИсключенийЗанятости;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивИсключенийЗанятости.Добавить(Выборка.ЗаписьКалендаря);
	КонецЦикла;
	
	Возврат МассивИсключенийЗанятости;
	
КонецФункции
